docmw/ESP32_Radio_Technics/include/SDcard.h
  //**************************************************************************************************
  //                                  C O N N E C T T O F I L E _ S D                                *
  //**************************************************************************************************
  // Open the local mp3-file.                                                                        *
  //**************************************************************************************************
  bool connecttofile_SD()
  {
    String path ;                                           // Full file spec

    stop_mp3client() ;                                      // Disconnect if still connected
    tftset ( 0, "MP3 Player" ) ;                            // Set screen segment top line
    displaytime ( "" ) ;                                    // Clear time on TFT screen
    setdatamode ( DATA ) ;                                  // Start in datamode 
    path = String ( getCurrentSDFileName() ) ;              // Set path to file to play
    icystreamtitle = path ;                                 // If no ID3 available
    icyname = String ( "" ) ;                               // If no ID3 available
    claimSPI ( "sdopen3" ) ;                                // Claim SPI bus
    handle_ID3_SD ( path ) ;                                // See if there are ID3 tags in this file
    releaseSPI() ;                                          // Release SPI bus
    if ( !mp3file )
    {
      dbgprint ( "Error opening file %s", path.c_str() ) ;  // No luck
      return false ;
    }
    mp3filelength = mp3file.available() ;                   // Get length
    //mqttpub.trigger ( MQTT_STREAMTITLE ) ;                  // Request publishing to MQTT
    chunked = false ;                                       // File not chunked
    metaint = 0 ;                                           // No metadata
    return true ;
  }


  //**************************************************************************************************
  //                                       M O U N T _ S D C A R D                                   *
  //**************************************************************************************************
  // Initialize the SD card.                                                                         *
  //**************************************************************************************************
  bool mount_SDCARD ( int8_t csPin )
  {
    bool       SD_okay = false ;                           // True if SD card in place and readable
    pinMode(2, INPUT_PULLUP);
    pinMode(4, INPUT_PULLUP);
    pinMode(12, INPUT_PULLUP);
    pinMode(15, INPUT_PULLUP);


    if ( !SD_MMC.begin ("/sdcard", true) )             // Yes, try to init SD card driver
    {
       dbgprint ( "SD Card Mount Failed!" ) ;             // No success, check formatting (FAT)
    }
    else
    {
       SD_okay = ( SD_MMC.cardType() != CARD_NONE ) ;         // See if known card
       if ( !SD_okay )
       {
          dbgprint ( "No SD card attached" ) ;             // Card not readable
       }
    }

    return SD_okay ;
  }


  //**************************************************************************************************
  //                                       S C A N _ S D C A R D                                     *
  //**************************************************************************************************
  // Scan the SD card for mp3-files.                                                                 *
  //**************************************************************************************************
  void scan_SDCARD()
  {
    clearFileList() ;                                   // Create list with names and count
    dbgprint ( "Locate mp3 files on SD, "
              "may take a while..." ) ;
    getsdtracks ( "/", SD_MAXDEPTH ) ;                  // Build file list
    dbgprint ( "Space %d", ESP.getFreeHeap() ) ;
    dbgprint ( "%d tracks on SD", SD_filecount ) ;      // Show number of files
    getFirstSDFileName() ;                              // Point to first entry
  }


  //**************************************************************************************************
  //                                       C L O S E _ S D C A R D                                   *
  //**************************************************************************************************
  // Close file on SD card.                                                                          *
  //**************************************************************************************************
  void close_SDCARD()
  {
    mp3file.close() ;
  }


  //**************************************************************************************************
  //                                       R E A D _ S D C A R D                                     *
  //**************************************************************************************************
  // Read a block of data from SD card file.                                                         *
  //**************************************************************************************************
  size_t read_SDCARD ( uint8_t* buf, uint32_t len )
  {
    return mp3file.read ( buf, len ) ;                   // Read a block of data
  }
#endif